{
  "nexus": {
    "id": "n1",
    "title": "Democratic Review by Rule of Maintenance",
    "content": "This Article advances a simple, administrable reform to reconcile constitutional adjudication with democratic accountability. Under a Rule of Maintenance, the Supreme Court will continue to adjudicate cases under existing precedent but may not change the level of protection for constitutional rights without democratic authorization. When a properly presented case would alter the rights baseline—either to restrict or to expand—two‑thirds of the Court must certify the framed constitutional question to Congress. The Court issues a maintenance judgment applying current law to the parties and stays any alteration pending a fast‑track, recorded legislative decision. To prevent majoritarian abuse, the design includes an Eternity Schedule of non‑derogable guarantees, sunsets for restrictions, and recertification rules.",
    "position": [0, 0, 0]
  },
  "nodes": [
    {
      "id": "l1-0",
      "parentId": "n1",
      "title": "Introduction: I. From Judicial Review to Judicial Supremacy",
      "content": "The scope of judicial authority in American constitutional law has never been definitively settled. In 1803, Chief Justice Marshall announced that it is emphatically the province and duty of the judicial department to say what the law is. This language supports a modest claim: when courts decide cases, they must interpret and apply the Constitution as law. But Marshall's dictum has been read to support a far more expansive proposition: that the Court's interpretation of the Constitution binds not only the parties before it, but all coordinate branches and even the American people as a whole.\n\nThe distinction between these two positions matters. Judicial review, modestly conceived, empowers courts to decline enforcement of statutes they deem unconstitutional in cases properly before them. This power follows from the Constitution's status as supreme law: when ordinary legislation conflicts with constitutional commands, courts must apply the higher law. Marshall himself framed the inquiry in these terms: It is a proposition too plain to be contested, that the constitution controls any legislative act repugnant to it. Judicial supremacy, by contrast, vests nine unelected Justices with final authority over contested constitutional meaning, treating the Court's pronouncements as equivalent to the constitutional text itself.\n\nA. The Departmentalist Tradition\n\nThis transformation was neither inevitable nor uncontested. Thomas Jefferson insisted that each of the three departments has equally the right to decide for itself what is its duty under the Constitution, without regard to what the others may have decided for themselves. On Jefferson's view, coordinate branches possess independent judgment; judicial interpretations bind only the case at hand, not constitutional meaning for all future controversies.\n\nAndrew Jackson, vetoing the Second Bank's recharter despite McCulloch v. Maryland's validation of the original Bank, declared bluntly that the opinion of the judges has no more authority over Congress than the opinion of Congress has over the judges. Jackson denied that precedent constrained executive or legislative constitutional interpretation: Each public officer who takes an oath to support the Constitution swears that he will support it as he understands it, and not as it is understood by others. For Jackson, McCulloch settled the dispute between the Bank and the state of Maryland; it did not settle the constitutional question for the nation.\n\nAbraham Lincoln, confronting Dred Scott v. Sandford, acknowledged the decision's binding effect on the parties but denied that it could irrevocably fix constitutional meaning for the nation: If the policy of the Government upon vital questions affecting the whole people is to be irrevocably fixed by decisions of the Supreme Court...the people will have ceased to be their own rulers. Lincoln distinguished judicial settlement of particular cases from judicial control over political questions. A decision might command obedience in the case decided, yet remain subject to challenge, legislative correction, or eventual overruling. This departmentalist position—that each branch interprets the Constitution within its sphere—competed with judicial supremacy well into the twentieth century.\n\nB. The Consolidation of Judicial Supremacy\n\nBut these departmentalist voices lost out, and by the early twentieth century, the Court functioned as the de facto final arbiter of constitutional disputes, though without explicit assertion of supremacy. The Lochner era (1897-1937) saw aggressive judicial invalidation of economic regulation, effectively entrenching the Court's constitutional vision over legislative judgments. Even after the switch in time of 1937 and the Court's retreat from economic due process, judicial authority over constitutional meaning remained largely unquestioned.\n\nThis transformation became explicit in Cooper v. Aaron (1958), where the Court, responding to Arkansas officials' resistance to desegregation, proclaimed that its interpretation of the Fourteenth Amendment is the supreme law of the land. This language collapsed a critical distinction: Article VI makes the Constitution itself supreme, not judicial opinions about it. As Justice Frankfurter's concurrence candidly stated, the Court's reading can be changed only by constitutional amendment or by a later decision of this Court. By elevating the Court's interpretations to constitutional status, Cooper converted the judiciary from a participant in constitutional dialogue into its monopolist.\n\nC. The Political Genealogy of Judicial Supremacy\n\nThe political genealogy of judicial supremacy is worth touching on here as its origins come from noble intentions. When Congress proved paralyzed by Southern filibusters in the mid-twentieth century, civil rights advocates turned to federal courts as the only national institution willing to act. The Warren Court's decisions—Brown v. Board of Education (1954), Gideon v. Wainwright (1963), Miranda v. Arizona (1966)—came to symbolize the Court as an engine of progress when democratic institutions stalled. Liberals embraced what Lincoln had condemned: locating society-defining choices in an institution insulated from democratic accountability.\n\nThough that shortcut achieved important and necessary ends, it still came at a cost. Once ideological control shifted, conservatives deployed the same tool in reverse. The Burger and Rehnquist Courts slowed or overturned rights expansion. The Roberts Court accelerated the reversal—limiting the Voting Rights Act in Shelby County v. Holder (2013), eliminating the constitutional right to abortion in Dobbs v. Jackson Women's Health Organization (2022), and restricting affirmative action in Students for Fair Admissions v. Harvard (2023). The oscillation between judicial progressivism and judicial conservatism reveals the core instability: rights grounded solely in five votes remain perpetually vulnerable to the next five votes - or nine votes; the number of Justices in agreement does not change the underlying dysfunction.\n\nD. The Path Forward\n\nThe legitimacy crisis we now inhabit is not an accident but the predictable result of concentrating power to resolve open-textured constitutional questions in a body whose members serve for life, face no electoral accountability, and claim authority to bind the nation's understanding of liberty, equality, and due process. This Article proposes a structural correction: courts retain authority to adjudicate cases, apply existing precedent, and enforce constitutional minima entrenched in text and structure. But transformative changes to the level of constitutional protection—expanding or restricting recognized rights—require democratic authorization through recorded congressional votes subject to procedural safeguards. The Rule of Maintenance preserves judicial independence for ordinary adjudication while returning society-defining constitutional shifts to democratic institutions, bounded by non-derogable guarantees that no majority may override.",
      "level": 1,
      "index": 0
    },
    {
      "id": "l1-1",
      "parentId": "n1",
      "title": "II. The Tenth Amendment's Truism and the Hollowing of Federalism",
      "content": "The Tenth Amendment states: The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people. On its face, this text announces a principle of enumerated federal powers with a residuum reserved to states and citizens. Yet doctrine has reduced this reservation to what the Court itself called but a truism, a statement so obvious it adds nothing to constitutional analysis.\n\nA. The Anti-Federalist Demand for Textual Reservation\n\nThe Tenth Amendment emerged from Anti-Federalist demands for explicit textual protection of state sovereignty. The Federal Farmer warned that without such safeguards, consolidation would swallow state authority: It is as true that when the people by their Constitution delegate powers to the Congress, they also reserve some powers in themselves. Brutus predicted that absent robust reservation, the federal government would annihilate the state governments.\n\nFederalists responded that enumeration itself sufficed. Congress possesses only delegated powers, making a reservation clause redundant. Madison argued in Federalist Nos. 39, 45, and 46 that states retained residuary sovereignty by constitutional structure, rendering the Tenth declaratory rather than substantive. This Federalist minimalism would eventually prevail.\n\nB. From McCulloch to Darby: The Erosion of Textual Federalism\n\nChief Justice Marshall's opinion in McCulloch v. Maryland (1819) gave the Necessary and Proper Clause its broad construction, permitting Congress to adopt means convenient or conducive to executing enumerated powers. The Tenth played no limiting role; Marshall emphasized that federal powers emanate from the people, not from states, and thus cannot be curtailed by state-sovereignty arguments.\n\nThe decisive blow came in United States v. Darby (1941). Upholding the Fair Labor Standards Act's regulation of wages and hours, the Court declared: The amendment states but a truism that all is retained which has not been surrendered. With this phrase, the Tenth was reduced from a potential check on federal power to a mere restatement of enumeration. If a power is delegated, the Tenth does not apply; if a power is not delegated, Congress lacks authority anyway. The Amendment adds nothing.\n\nLater decisions confirmed this retreat. In Garcia v. San Antonio Metropolitan Transit Authority (1985), the Court abandoned judicial enforcement of federalism limits, holding that State sovereign interests...are more properly protected by the procedural safeguards inherent in the structure of the federal system than by judicially created limitations. The Tenth, in other words, was judicially unenforceable, and a matter for political process, not constitutional law.\n\nC. The Partial Revival: Anti-Commandeering and Spending Coercion\n\nBeginning in the 1990s, the Court revived structural federalism limits, though not through the Tenth Amendment's text. In New York v. United States (1992), the Court invalidated a statute compelling states to legislate; in Printz v. United States (1997), it struck down federal conscription of state executive officers; and in Murphy v. NCAA (2018), it held that Congress cannot forbid states from repealing their own laws. Yet these holdings rest less on the Tenth Amendment itself than on structural principles implicit in the Constitution's federal design.\n\nSimilarly, in NFIB v. Sebelius (2012), the Court struck down the Affordable Care Act's mandatory Medicaid expansion as unconstitutionally coercive under the Spending Clause. Some hailed this as a Tenth Amendment revival, but the decision rests on spending-power limits, not the Tenth's text. Structural federalism survives in fragments, enforced unpredictably and categorically rather than as a continuous check on federal overreach.\n\nD. The Net Effect: Anemic Democratic Space\n\nThe overall effect is an anemic, sporadic federalism that too-rarely supplies a stable forum for democratic contestation or experimentation. The Tenth's promise—that undelegated powers remain with states and the people—has been hollowed out. What remains are episodic structural doctrines enforced inconsistently, leaving states with little autonomous constitutional space and citizens with no textual anchor for reserved authority. Combined with judicial supremacy, this erosion completes the double loss: the Court decides what the Constitution means, and little meaningful authority remains outside federal control.",
      "level": 1,
      "index": 1
    },
    {
      "id": "l1-2",
      "parentId": "n1",
      "title": "IV. Democratic Review by Rule of Maintenance - Overview",
      "content": "No single decision, not even one by the Supreme Court, should be able to reset the constitutional rights of 330 million people. If a properly presented case would change the existing level of constitutional protection—restrict or expand—the Supreme Court shall not decide that merits question. Instead, by a two‑thirds vote, the Court frames the constitutional question, certifies it to Congress, and enters a maintenance judgment applying the current baseline and staying any alteration pending democratic review.",
      "level": 1,
      "index": 2
    },
    {
      "id": "l1-3",
      "parentId": "n1",
      "title": "IV.A. Article III Compliance",
      "content": "The Rule of Maintenance does not violate Article III's case-or-controversy requirement. Critics might argue that certifying constitutional questions to Congress constitutes an advisory opinion. Advisory opinions are forbidden because they lack the concreteness and adverseness essential to judicial power: no live dispute, no binding effect on parties, and no concrete injury to remedy. Certification under the Rule of Maintenance satisfies all three requirements.\n\nFirst, there is a live case with concrete injury. The parties before the Court have an actual dispute requiring resolution. A plaintiff claims a constitutional right has been violated; a defendant contests the claim. The injury is real, the stakes are genuine, and the Court can provide relief.\n\nSecond, the Court renders binding judgment. The maintenance judgment applies existing precedent to resolve the parties' dispute. If current law favors the plaintiff, the plaintiff wins under the baseline; if current law favors the defendant, the defendant wins. The Court does not decline to decide—it decides under the controlling rule and stays only the alteration of that rule pending democratic review. This is adjudication with a remedial stay, not abstention.\n\nThird, the Court offers no merits preview of the certified question. Certification states only that adjudication would alter the baseline, identifies the existing rule, and frames the constitutional question for Congress. The Court does not opine on whether the alteration would be correct, desirable, or constitutionally required. It adjudicates the case under existing law and certifies the transformative question for democratic resolution.",
      "level": 1,
      "index": 3
    },
    {
      "id": "l1-4",
      "parentId": "n1",
      "title": "IV.B. Stare Decisis Constitutionalized",
      "content": "The Rule of Maintenance constitutionalizes stare decisis for rights questions. Courts retain full authority to apply existing precedent, distinguish cases, refine doctrine, and correct misapplications. What they cannot do unilaterally is alter the rights baseline—the level of protection established by controlling precedent. Transformation requires democratic authorization; application remains judicial. This preserves judicial independence for ordinary adjudication while returning society-defining constitutional shifts to democratic institutions. Error-correction continues—it simply proceeds through democratic channels bounded by non-derogable guarantees.\n\nThis approach differs fundamentally from both Article V amendment and ordinary judicial review. Article V permits constitutional text to change only through supermajority state ratification—a high bar appropriate for altering the Constitution's written commands. Current doctrine permits precedent to change through five votes on the Court—too low a bar for society-wide shifts in rights protection. The Rule of Maintenance occupies the middle ground: precedent governing rights baselines changes through recorded congressional votes, faster than Article V but more democratically accountable than judicial decree, and always subject to the Eternity Schedule's non-derogable floor.",
      "level": 1,
      "index": 4
    },
    {
      "id": "l1-5",
      "parentId": "n1",
      "title": "IV.C. Making the Trigger Administrable",
      "content": "The baseline is the controlling legal rule announced by the Supreme Court's most recent precedential decision on the right in question. This rule includes both the substantive test the Court applies (strict scrutiny, rational basis, text-history-and-tradition, etc.) and how burdens of proof are allocated (who must prove what to win).\n\nWhy precedent, not circuit practice? Lower federal courts often disagree with each other about how to apply Supreme Court doctrine. These circuit splits or circuit conflicts should not create ambiguity about the baseline. Only the Supreme Court's own precedent sets the national baseline for constitutional rights.\n\nA decision alters the baseline when it would: (i) Overrule or effectively overrule a controlling precedent; (ii) Replace or tighten the governing test or tier of scrutiny; (iii) Reallocate burdens of proof or production in a way that systematically changes outcomes; (iv) Narrow or expand the right's categorical domain by adding or removing classes of protected conduct; or (v) Convert exceptions into rules (or the reverse) such that expected outcomes materially shift for a class of cases.\n\nClose calls default to application. Reasonable jurists will sometimes disagree about whether a decision merely applies existing doctrine or alters it. To prevent gamesmanship and ensure only genuinely transformative moves trigger certification, close calls are treated as adjudication unless two-thirds of the Court affirmatively determines that the change is substantial.",
      "level": 1,
      "index": 5
    },
    {
      "id": "l1-6",
      "parentId": "n1",
      "title": "IV.D. Democratic Review Procedures",
      "content": "When the Supreme Court certifies a constitutional question to Congress, the certification triggers a mandatory legislative process designed to ensure timely, transparent democratic deliberation.\n\nCertified resolutions receive privileged floor status in both the House of Representatives and the Senate. The resolution proceeds directly to the floor without referral to committee. Congressional leadership cannot bottle up certified questions in committee or prevent floor consideration. Each House must schedule an up-or-down recorded vote within 120 days of certification.\n\nCongress acts on certified questions through joint resolution requiring passage by both Houses. If the Court certifies that a decision would expand constitutional protection beyond the current baseline, Congress may approve the expansion by simple majority in each House. Expansions, once approved, become part of the constitutional baseline and require no sunset or renewal.\n\nIf the Court certifies that a decision would restrict constitutional protection below the current baseline, Congress may approve the restriction only by recorded majority vote in each House, and the restriction automatically sunsets after five years unless affirmatively renewed. Time-limiting restrictions forces periodic democratic reauthorization and prevents temporary political majorities from permanently entrenching rights reductions.",
      "level": 1,
      "index": 6
    },
    {
      "id": "l1-7",
      "parentId": "n1",
      "title": "IV.E. The Eternity Schedule",
      "content": "Non‑derogable guarantees reflect republican essentials grounded in constitutional text and structure. Enumerated (non‑exhaustive): (a) bans on slavery and involuntary servitude; (b) bans on torture or cruel, inhuman, or degrading treatment; (c) bans on bills of attainder and ex post facto criminal laws; (d) basic political equality in voting and representation (one‑person‑one‑vote baseline, no race‑ or sex‑based disenfranchisement, no poll taxes); (e) core viewpoint neutrality in expressive freedom, with historically rooted exceptions (incitement, true threats, defamation, obscenity) cabined to their historical contours; and (f) criminal process minima rooted in the Fifth, Sixth, and Due Process guarantees (assistance of counsel in felony prosecutions, jury trial for serious offenses, confrontation, proof beyond a reasonable doubt understood as a due process requirement, and the privilege of habeas corpus except as constitutionally permitted). Certified resolutions are void insofar as they conflict with the Eternity Schedule.",
      "level": 1,
      "index": 7
    },
    {
      "id": "l1-8",
      "parentId": "n1",
      "title": "IV.F. Recertification and Lapse",
      "content": "If Congress takes no action within the clock, the maintenance baseline persists and the outcome is reported as democratic maintenance. The Court may not re‑certify the same framed question for five years absent material change. Material change means: (a) peer‑reviewed historical or empirical scholarship not reasonably available at initial certification; (b) an Act of Congress directly addressing the certified question; (c) a demonstrable nationwide shift in state practice (e.g., a supermajority of states change relevant law); or (d) a significant technological or factual development that undermines key factual assumptions of the baseline.",
      "level": 1,
      "index": 8
    },
    {
      "id": "l1-9",
      "parentId": "n1",
      "title": "V. Structural Cases and the Rights Trigger",
      "content": "Structural decisions (Necessary & Proper, nondelegation, major‑questions, deference doctrines) remain judicial by default. Certification arises in a structural case only when the Court's merits disposition would explicitly alter the doctrinal test governing an enumerated individual right (e.g., the First, Second, Fourth, Fifth, Sixth, Eighth, or Fourteenth Amendments). Indirect regulatory consequences—more or less environmental or workplace protection, different interpretive regimes for agencies—do not by themselves trigger certification. This preserves ordinary separation‑of‑powers adjudication while capturing direct doctrinal moves on rights.",
      "level": 1,
      "index": 9
    },
    {
      "id": "l1-10",
      "parentId": "n1",
      "title": "VI. Congress's Section 5 Power and Democratic Review",
      "content": "Katzenbach v. Morgan permits prophylactic enforcement; City of Boerne v. Flores requires that Section 5 legislation remain remedial, with congruence and proportionality to a documented pattern of state violations as the Court defines the right. Post‑Boerne cases (Morrison, Garrett; Hibbs, Lane) apply this fit. Under the Rule of Maintenance, when the Court certifies that a disposition would change the rights baseline, Congress must still satisfy Boerne's test (and the Eternity Schedule). Democratic Review channels big moves to Congress without licensing unconstitutional legislation.",
      "level": 1,
      "index": 10
    },
    {
      "id": "l1-11",
      "parentId": "n1",
      "title": "VII. Constitutional Development Under Maintenance",
      "content": "A. Error‑Correction (Within the Baseline)\n\nCourts correct misapplications, reconcile circuit conflicts, and refine doctrine within the existing test. Distinguishing facts, clarifying burdens, and tightening remedies are ordinary adjudication. Maintenance does not freeze law; it channels transformation.\n\nB. Incremental Refinement (Application, Not Alteration)\n\nApplying standing tests to new contexts—especially in technology—presumptively counts as application. The Technology Translation Presumption preserves doctrinal continuity while allowing adaptation case by case.\n\nC. Transformative Change (Certification)\n\nOverruling precedent, changing the governing test or burdens, or redefining the right's categorical domain are transformative moves that require democratic authorization via certification. The supermajority gate ensures only cross‑ideological recognition of transformation triggers certification.\n\nD. The Entrenched Error Objection\n\nIf all nine Justices believe a past baseline is wrong but disagree on the fix, maintenance holds the line unless Congress authorizes change. This is a feature, not a bug: it prevents ideological whipsawing and forces democratic ownership for society‑wide shifts. Error‑correction proceeds through proper application; transformation proceeds through certification and recorded votes. A manifest error carve‑out would re‑import judicial supremacy; this design instead privileges deliberation, stability, and accountability.",
      "level": 1,
      "index": 11
    },
    {
      "id": "l1-12",
      "parentId": "n1",
      "title": "VIII. Routing Examples",
      "content": "Speech: Content‑based bans beyond traditional exceptions—certify (2/3); absent approval, the existing speech baseline remains. Guns: Expanding sensitive places or tightening licensing beyond Heller/Bruen—certify. Fourth Amendment: Narrowing reasonable‑expectation‑of‑privacy for new technologies—certify; recognizing a warrant requirement for novel tech under existing tests is application. Substantive Due Process: Recognizing a new fundamental right or withdrawing one—certify. Equal Protection: Changing tiers or who is protected—certify; applying existing tiers without changing them is judicial. Structural: Nondelegation/major‑questions remain judicial unless the opinion explicitly alters an enumerated‑rights test; only then certify.",
      "level": 1,
      "index": 12
    },
    {
      "id": "l1-13",
      "parentId": "n1",
      "title": "IX. Objections and Replies",
      "content": "1) You've constitutionalized precedent; error‑correction now requires Congress.\n\nWe distinguish adjudication (application within the baseline) from transformation (baseline revision). Courts correct errors continuously through ordinary adjudication—distinguishing precedents, reconciling conflicts, refining tests, and clarifying doctrine. What requires democratic authorization is not error-correction but changing the rights baseline itself. This is stare decisis constitutionalized: precedent governs unless the people, through Congress, authorize departure.\n\n2) Baselines and pluralities are murky.\n\nWe specify a baseline rule (latest holding; Marks for pluralities; where Marks fails, last clear majority rule). Tests and burdens are part of the baseline; circuit flux never sets it. Close calls default to application unless two‑thirds deem the change substantial.\n\n3) Technology makes application vs. alteration ideological.\n\nTrue that characterization fights persist; the Technology Translation Presumption plus the two‑thirds gate ensures only cross‑ideological recognition of substantial change triggers certification.\n\n4) Sunset asymmetry favors expansion.\n\nYes. Rights restrictions should be temporary unless democratically renewed; expansions, once endorsed, need not be repeatedly re‑justified. The design privileges liberty and guards against entrenching burdens—while permitting Congress later to restrict via certification if consensus supports it.\n\n5) Structural rulings indirectly affect rights.\n\nCertification triggers only when a structural merits disposition explicitly alters an enumerated‑rights doctrinal test. Indirect regulatory consequences do not trigger certification.\n\n6) What about statutory rights?\n\nCongress can amend statutes. Optionally, Congress may designate Rights‑Carrying Super‑Statutes whose contraction requires a recorded two‑thirds vote or a maintenance‑style certification tied to a certified constitutional ruling—harmonizing statutory and constitutional protection without complicating the core design.",
      "level": 1,
      "index": 13
    },
    {
      "id": "l1-14",
      "parentId": "n1",
      "title": "X. Amendment and Implementing Text",
      "content": "A. Constitutional Amendment (Clean Text)\n\nSection 1. The judicial power shall not be exercised to alter the existing level of constitutional protection for individual rights recognized by controlling precedent.\n\nSection 2. When a case properly before the Supreme Court would require expanding or restricting that protection, the Court, by a vote of two‑thirds of its members, shall identify the question of constitutional meaning and certify it to Congress. The Court shall enter judgment maintaining the prevailing level of protection and may stay or tailor remedies as necessary pending congressional action.\n\nSection 3. Certified questions shall receive privileged floor status and each House shall hold an up-or-down recorded vote within 120 days. Any resolution that restricts rights sunsets after five years unless renewed.\n\nSection 4. No resolution may contravene non‑derogable guarantees designated by amendment.\n\nB. Implementing Statute (Core Mechanics)\n\nTrigger defined: Alters protection means (i) overruling or effectively overruling a controlling precedent; (ii) replacing or tightening the governing test or tier; (iii) reallocating burdens to systematically change outcomes; (iv) expanding or narrowing categorical coverage; or (v) converting exceptions to rules. Certification record: the Court states only that adjudication would alter the baseline, identifies the framed question and baseline precedent, and offers no merits view. Fast‑track: privileged floor status; up‑or‑down recorded vote in each House within 120 days (30 days if the Court designates a Certified Emergency Track). Sunsets & review: rights‑restricting approvals lapse in five years unless renewed; courts retain review to enforce the Eternity Schedule and, where applicable, Section 5's congruence‑and‑proportionality.",
      "level": 1,
      "index": 14
    },
    {
      "id": "l1-15",
      "parentId": "n1",
      "title": "XI. Conclusion",
      "content": "Democratic Review by Rule of Maintenance restores a republican equilibrium: courts adjudicate and enforce entrenched minima; the people, through Congress, own society‑wide shifts in rights. By separating application from alteration, the design preserves judicial independence, demands democratic accountability, and grounds constitutional legitimacy in both law and consent.",
      "level": 1,
      "index": 15
    }
  ]
}